![png](Data/movies.png)

In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote
import os
from sqlalchemy.types import VARCHAR, CHAR, DECIMAL, DATE, DATETIME

In [2]:
username = "root"
password = "root"

connection = f"mysql+pymysql://{username}:{urlquote(password)}@localhost/movies"
engine = create_engine(connection)
conn = engine.connect()

In [3]:
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [4]:
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

In [5]:
q = '''DESCRIBE genres;'''
describe_genres = pd.read_sql(q, connection)
describe_genres

        Field         Type Null  Key Default Extra
0    genre_id          int   NO  PRI    None
1  genre_name  varchar(45)  YES         None

In [6]:
q = '''DESCRIBE ratings;'''
describe_ratings = pd.read_sql(q, connection)
describe_ratings

             Field         Type Null  Key Default Extra
0           tconst     char(12)   NO  PRI    None
1   average_rating  varchar(45)  YES         None
2  number_of_votes          int  YES         None

In [7]:
q = '''DESCRIBE title_basics;'''
describe_basics = pd.read_sql(q, connection)
describe_basics

           Field          Type Null  Key Default Extra
0         tconst      char(12)   NO  PRI    None
1  primary_title  varchar(255)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

In [8]:
ratings = pd.read_csv('ratings.csv')
ratings.head(1)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1988

In [9]:
basics = pd.read_csv('bascis.csv')
basics.head(1)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance"

In [10]:
column_name_change = {'averageRating': 'average_rating', 'numVotes': 'number_of_votes'}
ratings = ratings.rename(columns=column_name_change)

In [11]:
ratings['tconst'].head(1)

0    tt0000001
Name: tconst, dtype: object

In [12]:
ratings.head(5)

      tconst  average_rating  number_of_votes
0  tt0000001             5.7             1988
1  tt0000002             5.8              265
2  tt0000005             6.2             2632
3  tt0000006             5.1              182
4  tt0000007             5.4              825

In [13]:
basics.head(5)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,126,Drama

In [14]:
genres = basics[['tconst', 'genres']].copy()
genres.head(5)

      tconst                  genres
0  tt0035423  Comedy,Fantasy,Romance
1  tt0062336                   Drama
2  tt0069049                   Drama
3  tt0088751    Comedy,Horror,Sci-Fi
4  tt0096056                   Drama

In [15]:
basics = basics.drop(columns=['titleType', 'originalTitle','isAdult','genres'])
basics.head(5)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

In [16]:
basics = basics.rename(columns={'primaryTitle': 'primary_title', 'startYear': 'start_year', 'runtimeMinutes': 'runtime'})
basics.head(5)

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

In [17]:
basics['tconst'] = basics['tconst'].str.replace('tt', '')
basics['tconst'] = basics['tconst'].astype(int)
basics.dtypes

tconst            int32
primary_title    object
start_year        int64
runtime           int64
dtype: object

In [18]:
genres['tconst'] = genres['tconst'].str.replace('tt', '')
genres['tconst'] = genres['tconst'].astype(int)
genres.dtypes

tconst     int32
genres    object
dtype: object

In [19]:
genres = genres.rename(columns={'tconst': 'genre_id','genres': 'genre_name'})
genres.head(9)

   genre_id              genre_name
0     35423  Comedy,Fantasy,Romance
1     62336                   Drama
2     69049                   Drama
3     88751    Comedy,Horror,Sci-Fi
4     96056                   Drama
5    100275    Comedy,Drama,Fantasy
6    103340         Biography,Drama
7    108549          Comedy,Mystery
8    113026         Musical,Romance

In [20]:
basics.head(5)

,tconst,primary_title,start_year,runtime
0,35423,Kate & Leopold,2001,118
1,62336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,69049,The Other Side of the Wind,2018,122
3,88751,The Naked Monster,2005,100
4,96056,Crime and Punishment,2002,126

In [21]:
title_length = basics['primary_title'].fillna('').map(len).max()
title_length

242

In [22]:
genre_length = genres['genre_name'].fillna('').map(len).max()
genre_length

29

In [23]:
ratings.to_sql("ratings",connection,index=False, if_exists='append')

370233

In [24]:
basics.to_sql("title_basics",connection,index=False, if_exists='append')

86979

In [25]:
genres.to_sql("genres",connection,index=False, if_exists='append')

86979

In [26]:
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

In [27]:
q = '''DESCRIBE genres;'''
describe_genres = pd.read_sql(q, connection)
describe_genres

        Field         Type Null  Key Default Extra
0    genre_id          int   NO  PRI    None
1  genre_name  varchar(45)  YES         None

In [28]:
q = '''DESCRIBE ratings;'''
describe_ratings = pd.read_sql(q, connection)
describe_ratings

             Field         Type Null  Key Default Extra
0           tconst     char(12)   NO  PRI    None
1   average_rating  varchar(45)  YES         None
2  number_of_votes          int  YES         None

In [29]:
q = '''DESCRIBE title_basics;'''
describe_basics = pd.read_sql(q, connection)
describe_basics

           Field          Type Null  Key Default Extra
0         tconst      char(12)   NO  PRI    None
1  primary_title  varchar(255)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

In [30]:
q = '''SELECT *
FROM title_basics
LIMIT 5'''
title_basics_first_5_rows = pd.read_sql(q, connection)
title_basics_first_5_rows

    tconst                             primary_title  start_year  runtime
0  1000017                              Torture Room        2007       83
1  1000020                                 Windstorm        2007       77
2  1000070      Billy & Mandy's Big Boogey Adventure        2007       80
3  1000095  Pok√©mon Ranger and the Temple of the Sea        2006      105
4  1000106                                 Indelible        2007      107

In [31]:
q = '''SELECT *
FROM ratings
LIMIT 5'''
ratings_first_5_rows = pd.read_sql(q, connection)
ratings_first_5_rows

      tconst average_rating  number_of_votes
0  tt0000001            5.7             1988
1  tt0000002            5.8              265
2  tt0000005            6.2             2632
3  tt0000006            5.1              182
4  tt0000007            5.4              825

In [32]:
q = '''SELECT *
FROM genres
LIMIT 5'''
genres_first_5_rows = pd.read_sql(q, connection)
genres_first_5_rows

   genre_id              genre_name
0     35423  Comedy,Fantasy,Romance
1     62336                   Drama
2     69049                   Drama
3     88751    Comedy,Horror,Sci-Fi
4     96056                   Drama